import { Collapse, Row, Col, Flex } from "antd";
import SectionContainer from "../common/SectionContainer";

const collapseItems = [
  {
    key: "1",
    label: <strong>Какви услуги предлагате?</strong>,
    children: (
      <p>
        Ние предлагаме широк спектър от почистващи услуги, включително основно и
        абонаментно почистване на домове и офиси, почистване след ремонт,
        прозорци, мека мебел, както и специализирани услуги като пране на килими
        и матраци.
      </p>
    ),
  },
  {
    key: "2",
    label: <strong>Колко време отнема почистването?</strong>,
    children: (
      <p>
        Времето за почистване зависи от големината на помещението и вида на
        избраната услуга. Обикновено за стандартно почистване на апартамент
        отнема около 2-3 часа, но за по-големи обекти или при специфични
        изисквания времето може да е по-дълго.
      </p>
    ),
  },
  {
    key: "3",
    label: <strong>Какво да правя, ако не съм доволен от почистването?</strong>,
    children: (
      <p>
        Вашето удовлетворение е наш приоритет! Ако по някаква причина не сте
        доволни от резултата, моля свържете се с нас в рамките на 24 часа и ние
        ще организираме безплатно повторно почистване.
      </p>
    ),
  },
  {
    key: "4",
    label: <strong>Как се осигурява качеството на почистването?</strong>,
    children: (
      <p>
        Нашият екип от професионалисти преминава обучение и се грижи за високото
        качество на услугите, които предоставяме. След всяко почистване
        извършваме проверка, за да се уверим, че всичко е почистено според
        стандартите ни.
      </p>
    ),
  },
  {
    key: "5",
    label: <strong>Как мога да направя резервация?</strong>,
    children: (
      <p>
        Можете лесно да направите резервация чрез нашия онлайн формуляр, като
        изберете желаната услуга, дата и час. Също така, може да ни се обадите
        или да изпратите имейл за директна резервация.
      </p>
    ),
  },
  {
    key: "6",
    label: <strong>Работите ли през почивните дни?</strong>,
    children: (
      <p>
        Да, нашите услуги са достъпни през всички дни от седмицата, включително
        събота и неделя, за да се съобразим с вашето натоварено ежедневие.
      </p>
    ),
  },
];

const Faq = () => {
  return (
    <SectionContainer
      id="faq"
      title="Често задавани въпроси"
      viewHeight={100}
      maxHeight={700}
    >
      <Row
        style={{
          padding: "20px",
          maxWidth: "1300px ",
        }}
        justify="space-between"
      >
        <Col xs={24} sm={24} md={10} lg={10}>
          <Flex gap={15} vertical>
            <p>
              Нашата секция с често задавани въпроси е създадена, за да ви
              спести време и да ви помогне да получите бързо отговор на
              най-често задаваните въпроси. Разгледайте по-долу за повече
              информация относно нашите услуги, процеса на работа и условията за
              резервации.
            </p>
            <p>
              Не успяхте да намерите отговора, който търсите? Свържете се с
              нашия екип, за да получите по-подробна информация или да обсъдите
              вашите специфични нужди.
            </p>
          </Flex>
        </Col>
        <Col xs={24} sm={24} md={12} lg={12}>
          <Collapse
            expandIconPosition="end"
            ghost
            accordion
            items={collapseItems}
          />
        </Col>
      </Row>
    </SectionContainer>
  );
};

export default Faq;
