import "../styles/AboutUs.css";

const AboutUs = () => {
  return (
    <div className="contact-us-container">
      <h1 className="about-us-title">Кои сме ние?</h1>
      <p>
        Ние сме фирма започнала дейността си в сферата на почистването през 2016
        г. в Лондон. През 2018 г. стъпихме на българския пазар под името Торнадо
        Клийн.От 2020 г. Торнадо Сървисиз сключи 5 годишен договор с
        най-голямата австралийска почистваща компания. В партньорство с нея
        Торнадо започна да предлага услуги различни от почистването, но пак
        свързани с нуждите на едно домакинство. Успехите зад граница се
        прехвърлиха и в родината ни и смело се утвърждава на пазара, вече не
        само в Англия, но и в България.
      </p>
    </div>
  );
};

export default AboutUs;
